---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.LogicalAndFilter
source: html/1b21d9d2-f07a-d092-a5e5-ed151ae6fb1c.htm
---
# LogicalAndFilter Members

Constructs a new instance of the logical filter with any number of input filters.